




const List<Map>islamicData = [
  {"id": 1,
    "question":
        "  النبي الذي أرسل إلى قوم عاد هو",
    "options": ['صالح', 'هود', 'شعيب', 'نوح'],
    "answer_index": 1,

  },
  {"id": 2,
    "question":' ترتيب شهر شعبان في السنة الهجرية',
      
    "options": ['الثالث', 'السابع', 'التاسع', 'الثامن'],
    "answer_index": 3,

  },
  {"id": 3,
    "question":' النبي الذي لقب بذي النون',
      
    "options": ['موسى', 'نوح', 'يونس', 'هود'],
    "answer_index":2 ,

  },
  {"id": 4,
    "question":' الصحابي الذي كانت تستحي منه الملائكة',
      
    "options": ['علي بن أبي طالب', 'عثمان بن عفان', 'أبو بكر الصديق', 'عمر بن الخطاب'],
    "answer_index": 1,

  },
  {"id": 5,
    "question":'سورة في القرآن الكريم عرفت باسم سورة المواريث ',
      
    "options": ['النساء', 'البقرة', 'آل عمران', 'الكهف'],
    "answer_index": 0,

  },
  {"id": 6,
    "question":' النبي الذي لقب بـ : "الصديق".',
      
    "options": ['عيسى', 'موسى', 'يوسف', 'محمد'],
    "answer_index": 2,

  },
  {"id": 7,
    "question":'لمن أرسل نبي الله صالح؟',
      
    "options": ['ثمود', 'عاد', 'مدين', 'إسرائيل'],
    "answer_index": 0,

  },
  {"id": 8,
    "question":'الصحابي الذي لقب بـ : "أسد الله ورسوله"',
      
    "options": ['علي بن أبي طالب', 'عمر بن الخطاب', 'حمزة بن عبدالمطلب', 'عمرو بن العاص'],
    "answer_index": 2,

  },
  {"id": 9,
    "question":' الصحابي الي لقب بـ : "حبر الأمة" ',
      
    "options": ['عبدالله بن عباس', 'علي بن أبي طالب ', 'عبدالله بن مسعود', 'زيد بن حارثة'],
    "answer_index": 0,

  },
  {"id": 10,
    "question":' الصحابي الذي لقب بـ : " حب رسول الله"',
      
    "options":  ['أسامة بن زيد', 'بلال بن رباح', 'عبدالله بن مسعود', 'زيد بن حارثة'],
    "answer_index": 3,

  },
 
];
